# DividedSurfacePatternFillMaterial Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfacePatternFillMaterial Property
ParameterTypeId Class See Also
---
"Pattern Fill Material"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfacePatternFillMaterial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfacePatternFillMaterial As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfacePatternFillMaterial {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace